Dlubal.DynamPro.NVCResultsModeShapesOnNode
Natural Vibration Case results - Mode Shapes on node

Dlubal.DynamPro.NVCResultsModeShapesOnNode.ModeShape
Number of mode shape

Dlubal.DynamPro.NVCResultsModeShapesOnNode.Node
Number of node (corresponds to number of FE mesh point in RFEM)

Dlubal.DynamPro.NVCResultsModeShapesOnNode.StdDisplacementX
Standardized Displacement X [m]

Dlubal.DynamPro.NVCResultsModeShapesOnNode.StdDisplacementY
Standardized Displacement Y [m]

Dlubal.DynamPro.NVCResultsModeShapesOnNode.StdDisplacementZ
Standardized Displacement Z [m]

Dlubal.DynamPro.NVCResultsModeShapesOnNode.StdRotationX
Standardized rotation X [-]

Dlubal.DynamPro.NVCResultsModeShapesOnNode.StdRotationY
Standardized rotation Y [-]

Dlubal.DynamPro.NVCResultsModeShapesOnNode.StdRotationZ
Standardized rotation Z [-]